Revit 2027 API
BentFabricStraightWiresLocation Enumeration
 Bent Fabric straight wires location. The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BentFabricStraightWiresLocation
Public Enumeration BentFabricStraightWiresLocation
public enum class BentFabricStraightWiresLocation
type BentFabricStraightWiresLocation
Members
Member name | Value | Description
Left | 1 |  Fabric straight wires are located on the left side of bent wires.
Right | 0 |  Fabric straight wires are located on the right side of bent wires.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace